Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: [0030] In an example, the updating, by the source base station, a context of the terminal in the source base station includes: increasing, by the source base station, the quantity of rejection times in the context of the terminal by 1.
de_de: [0030] In einem Beispiel beinhaltet das Aktualisieren, durch die Quellbasisstation, eines Kontexts des Endgeräts in der Quellbasisstation: Erhöhen, durch die Quellbasisstation, der Anzahl von Ablehnungszeiten im Kontext des Endgeräts um 1.

source: [0031] In a possible implementation, the updating, by the source base station, a context of the terminal in the source base station includes: updating, by the source base station, an access stratum key in the context of the terminal.
de_de: [0031] Bei einer möglichen Implementierung beinhaltet das Aktualisieren, durch die Quellbasisstation, eines Kontexts des Endgeräts in der Quellbasisstation: Aktualisieren, durch die Quellbasisstation, eines Zugriffsschichtschlüssels im Kontext des Endgeräts.

source: [0032] In a possible implementation, the message authentication code is generated based on the freshness parameter and the integrity protection key that is of the terminal, where freshness parameters used to generate message authentication codes at two consecutive times are different; and the checking, by the source base station, the message authentication code based on an integrity protection key of the source base station includes: checking, by the source base station, the message authentication code based on the freshness parameter and the integrity protection key that is of the source base station.
de_de: [0032] Bei einer möglichen Implementierung wird der Nachrichtenauthentifizierungscode basierend auf dem Aktualitätsparameter und dem Integritätsschutzschlüssel, der von dem Endgerät ist, erzeugt, wobei Aktualitätsparameter, die zum Erzeugen von Nachrichtenauthentifizierungscodes zu zwei aufeinanderfolgenden Zeitpunkten verwendet werden, unterschiedlich sind; und das Prüfen, durch die Quellbasisstation, des Nachrichtenauthentifizierungscodes basierend auf einem Integritätsschutzschlüssel der Quellbasisstation beinhaltet: Prüfen, durch die Quellbasisstation, des Nachrichtenauthentifizierungscodes basierend auf dem Aktualitätsparameter und dem Integritätsschutzschlüssel, der von der Quellbasisstation ist.

source: [0033] In a possible implementation, the notification message further includes an indication parameter, and the indication parameter is used to indicate the freshness parameter.
de_de: [0033] Bei einer möglichen Implementierung beinhaltet die Benachrichtigungsnachricht ferner einen Anzeigeparameter, und der Anzeigeparameter wird verwendet, um den Aktualitätsparameter anzuzeigen.

source: [0034] In an example, the freshness parameter includes a packet data convergence protocol count (PDCP count), and the updating, by the source base station, a context of the terminal in the source base station includes: updating, by the source base station if a value of the PDCP count is greater than a value of a PDCP count in the context of the terminal, the value of the PDCP count in the context of the terminal to the value of the PDCP count indicated by the indication parameter.
de_de: [0034] In einem Beispiel beinhaltet der Aktualitätsparameter eine Paketdatenkonvergenzprotokoll-Zählung (PDCP-Zählung), und das Aktualisieren, durch die Quellbasisstation, eines Kontexts des Endgeräts in der Quellbasisstation beinhaltet: Aktualisieren, durch die Quellbasisstation, wenn ein Wert der PDCP-Zählung größer als ein Wert einer PDCP-Zählung in dem Kontext des Endgeräts ist, des Werts der PDCP-Zählung in dem Kontext des Endgeräts auf den Wert der PDCP-Zählung, der durch den Anzeigeparameter angezeigt wird.

source: [0035] According to a fifth aspect, this application provides a connection resume request method, including: receiving, by a source base station, a context request message from a target base station, where the context request message includes a message authentication code; the message authentication code is generated based on a freshness parameter and an integrity protection key that is of a terminal, where freshness parameters used to generate message authentication codes at two consecutive times are different; and the context request message is used to request to obtain a context of the terminal; checking, by the source base station, the message authentication code based on the freshness parameter and an integrity protection key that is of the source base station; and updating, by the source base station, the freshness parameter in the context of the terminal if checking the message authentication code to be successful, and sending a context response message to the target base station, where the context response message includes the context of the terminal.
de_de: [0035] Gemäß einem fünften Aspekt stellt diese Anmeldung ein Verbindungswiederaufnahmeanforderungsverfahren bereit, das Folgendes beinhaltet: Empfangen, durch eine Quellbasisstation, einer Kontextanforderungsnachricht von einer Zielbasisstation, wobei die Kontextanforderungsnachricht einen Nachrichtenauthentifizierungscode beinhaltet; der Nachrichtenauthentifizierungscode wird basierend auf einem Aktualitätsparameter und einem Integritätsschutzschlüssel, der von einem Endgerät ist, erzeugt, wobei Aktualitätsparameter, die zum Erzeugen von Nachrichtenauthentifizierungscodes zu zwei aufeinanderfolgenden Zeitpunkten verwendet werden, unterschiedlich sind; und die Kontextanforderungsnachricht wird verwendet, um anzufordern, einen Kontext des Endgeräts zu erhalten; Prüfen, durch die Quellbasisstation, des Nachrichtenauthentifizierungscodes basierend auf dem Aktualitätsparameter und einem Integritätsschutzschlüssel, der von der Quellbasisstation ist; und Aktualisieren, durch die Quellbasisstation, des Aktualitätsparameters in dem Kontext des Endgeräts, wenn geprüft wird, dass der Nachrichtenauthentifizierungscode erfolgreich ist, und Senden einer Kontextantwortnachricht an die Zielbasisstation, wobei die Kontextantwortnachricht den Kontext des Endgeräts beinhaltet.

source: [0036] In a possible implementation, the freshness parameter includes a quantity of rejection times, and the quantity of rejection times is used to indicate a quantity of times for which resuming of the RRC connection that the terminal attempts to perform is rejected; and updating, by the source base station, the context of the terminal in the source base station includes: resetting, by the source base station, the quantity of rejection times in the context of the terminal to zero.
de_de: [0036] Bei einer möglichen Implementierung beinhaltet der Aktualitätsparameter eine Anzahl von Ablehnungszeiten, und die Anzahl von Ablehnungszeiten wird verwendet, um eine Anzahl von Zeiten anzugeben, für die die Wiederaufnahme der RRC-Verbindung, die das Endgerät durchzuführen versucht, abgelehnt wird; und das Aktualisieren, durch die Quellbasisstation, des Kontexts des Endgeräts in der Quellbasisstation beinhaltet: Zurücksetzen, durch die Quellbasisstation, der Anzahl von Ablehnungszeiten in dem Kontext des Endgeräts auf null.

source: [0037] In a possible implementation, the context request message further includes an indication parameter, the indication parameter is used to indicate the freshness parameter, and the freshness parameter includes a PDCP count; and the updating, by the source base station, the context of the terminal in the source base station includes: updating, by the source base station if a value of the PDCP count is greater than a value of a PDCP count in the context of the terminal, the value of the PDCP count in the context of the terminal to the value of the PDCP count indicated by the indication parameter.
de_de: [0037] Bei einer möglichen Implementierung beinhaltet die Kontextanforderungsnachricht ferner einen Anzeigeparameter, der Anzeigeparameter wird verwendet, um den Aktualitätsparameter anzugeben, und der Aktualitätsparameter beinhaltet eine PDCP-Zählung; und das Aktualisieren, durch die Quellbasisstation, des Kontexts des Endgeräts in der Quellbasisstation beinhaltet: Aktualisieren, durch die Quellbasisstation, falls ein Wert der PDCP-Zählung größer als ein Wert einer PDCP-Zählung in dem Kontext des Endgeräts ist, des Werts der PDCP-Zählung in dem Kontext des Endgeräts auf den Wert der PDCP-Zählung, der durch den Anzeigeparameter angegeben wird.

source: [0038] In an example, the indication parameter includes some bits of the PDCP count; and the source base station determines, based on the indication parameter, the PDCP count indicated by the indication parameter.
de_de: [0038] In einem Beispiel beinhaltet der Anzeigeparameter einige Bits der PDCP-Zählung; und die Quellbasisstation bestimmt, basierend auf dem Anzeigeparameter, die PDCP-Zählung, die durch den Anzeigeparameter angegeben wird.

source: [0039] According to a sixth aspect, this application provides an apparatus.
de_de: [0039] Gemäß einem sechsten Aspekt stellt diese Anmeldung eine Vorrichtung bereit.

source: The apparatus may be a terminal, or may be a chip in a terminal. The apparatus has a function of implementing each embodiment of the first aspect.
de_de: Die Vorrichtung kann ein Endgerät sein oder kann ein Chip in einem Endgerät sein. Die Vorrichtung weist eine Funktion zum Implementieren jeder Ausführungsform des ersten Aspekts auf.

source: The function may be implemented by hardware, or may be implemented by hardware by executing corresponding software.
de_de: Die Funktion kann durch Hardware implementiert werden oder kann durch Hardware durch Ausführen entsprechender Software implementiert werden.

source: The hardware or the software includes one or more modules corresponding to the foregoing functions.
de_de: Die Hardware oder die Software beinhaltet ein oder mehrere Module, die den vorstehenden Funktionen entsprechen.

source: [0040] In a possible design, when the apparatus is the terminal, the terminal includes a sending unit and a processing unit, and optionally further includes a receiving unit.
de_de: [0040] In einer möglichen Ausgestaltung, wenn die Vorrichtung das Endgerät ist, beinhaltet das Endgerät eine Sendeeinheit und eine Verarbeitungseinheit und optional ferner eine Empfangseinheit.

source: The processing unit may be, for example, a processor, the receiving unit may be, for example, a receiver, and the sending unit may be, for example, a transmitter.
de_de: Die Verarbeitungseinheit kann zum Beispiel ein Prozessor sein, die Empfangseinheit kann zum Beispiel ein Empfänger sein und die Sendeeinheit kann zum Beispiel ein Sender sein.

source: The receiver and the transmitter include a radio frequency circuit.
de_de: Der Empfänger und der Sender umfassen eine Funkfrequenzschaltung.

source: Optionally, the terminal further includes a storage unit, and the storage unit may be, for example, a memory.
de_de: Optional umfasst das Endgerät ferner eine Speichereinheit, und die Speichereinheit kann beispielsweise ein Speicher sein.

source: When the terminal includes the storage unit, the storage unit stores a computer executable instruction, the processing unit is connected to the storage unit, and the processing unit executes the computer executable instruction stored in the storage unit, to enable the terminal to perform the connection resume request method according to any implementation of the first aspect.
de_de: Wenn das Endgerät die Speichereinheit umfasst, speichert die Speichereinheit eine computerausführbare Anweisung, die Verarbeitungseinheit ist mit der Speichereinheit verbunden, und die Verarbeitungseinheit führt die in der Speichereinheit gespeicherte computerausführbare Anweisung aus, um es dem Endgerät zu ermöglichen, das Verbindungswiederaufnahmeanforderungsverfahren gemäß einer beliebigen Implementierung des ersten Aspekts durchzuführen.

source: [0041] In another possible design, when the apparatus is the chip in the terminal, the chip includes a sending unit and a processing unit, and optionally further includes a receiving unit.
de_de: [0041] In einer möglichen Ausgestaltung, wenn die Vorrichtung das Endgerät ist, beinhaltet das Endgerät eine Sendeeinheit und eine Verarbeitungseinheit und optional ferner eine Empfangseinheit.

source: The processing unit may be, for example, a processing circuit, the receiving unit may be, for example, an input interface, a pin, a circuit, or the like, and the sending unit may be, for example, an output interface, a pin, a circuit, or the like.
de_de: Die Verarbeitungseinheit kann zum Beispiel eine Verarbeitungsschaltung sein, die Empfangseinheit kann zum Beispiel eine Eingabeschnittstelle, ein Pin, eine Schaltung oder dergleichen sein und die Sendeeinheit kann zum Beispiel eine Ausgabeschnittstelle, ein Pin, eine Schaltung oder dergleichen sein.

source: The processing unit may execute the computer executable instruction stored in the storage unit, so that the connection resume request method according to any implementation of the first aspect is performed.
de_de: Die Verarbeitungseinheit kann die in der Speichereinheit gespeicherte computerausführbare Anweisung ausführen, so dass das Verbindungswiederaufnahmeanforderungsverfahren gemäß einer beliebigen Implementierung des ersten Aspekts durchgeführt wird.

source: Optionally, the storage unit may be a storage unit in the chip, such as a register or a cache.
de_de: Optional kann die Speichereinheit eine Speichereinheit in dem Chip sein, wie etwa ein Register oder ein Cache.

source: Alternatively, the storage unit may be a storage unit that is in the terminal and that is located outside the chip, such as a read-only memory (read-only memory, ROM), another type of static storage device that can store static information and an instruction, or a random access memory (random access memory, RAM).
de_de: Alternativ kann die Speichereinheit eine Speichereinheit sein, die sich in dem Endgerät befindet und die sich außerhalb des Chips befindet, wie etwa ein Nur-Lese-Speicher (Read-Only Memory, ROM), eine andere Art von statischer Speichervorrichtung, die statische Informationen und eine Anweisung speichern kann, oder ein Direktzugriffsspeicher (Random Access Memory, RAM).

source: [0042] The processor mentioned anywhere above may be a general-purpose central processing unit (Central Processing Unit, CPU), a microprocessor, an application-specific integrated circuit (application-specific integrated circuit, ASIC), or one or more integrated circuits configured to control program execution of the connection resume request method according to any implementation of the first aspect.
de_de: [0042] Der Prozessor, der an einer beliebigen Stelle oben erwähnt ist, kann eine universelle zentrale Verarbeitungseinheit (Central Processing Unit, CPU), ein Mikroprozessor, eine anwendungsspezifische integrierte Schaltung (Application-Specific Integrated Circuit, ASIC) oder eine oder mehrere integrierte Schaltungen sein, die konfiguriert sind, um die Programmausführung des Verbindungswiederaufnahmeanforderungsverfahrens gemäß einer beliebigen Implementierung des ersten Aspekts zu steuern.

source: [0043] According to a seventh aspect, this application provides an apparatus.
de_de: [0043] Gemäß einem siebten Aspekt stellt diese Anmeldung eine Vorrichtung bereit.

source: The apparatus may be a target base station, or may be a chip in a target base station.
de_de: Die Vorrichtung kann eine Zielbasisstation sein oder kann ein Chip in einer Zielbasisstation sein.

source: The apparatus has a function of implementing each embodiment of the second aspect.
de_de: Die Vorrichtung weist eine Funktion zum Implementieren jeder Ausführungsform des zweiten Aspekts auf.

source: [0044] In a possible design, when the apparatus is the target base station, the base station includes a receiving unit and a sending unit, and optionally further includes a processing unit.
de_de: [0044] In einer möglichen Ausgestaltung beinhaltet die Basisstation, wenn die Vorrichtung die Zielbasisstation ist, eine Empfangseinheit und eine Sendeeinheit und optional ferner eine Verarbeitungseinheit.

source: Optionally, the base station further includes a storage unit, and the storage unit may be, for example, a memory.
de_de: Optional umfasst die Basisstation ferner eine Speichereinheit, und die Speichereinheit kann beispielsweise ein Speicher sein.

source: When the base station includes the storage unit, the storage unit stores a computer executable instruction, the processing unit is connected to the storage unit, and the processing unit executes the computer executable instruction stored in the storage unit, to enable the base station to perform the connection resume request method according to any implementation of the second aspect.
de_de: Wenn die Basisstation die Speichereinheit beinhaltet, speichert die Speichereinheit eine computerausführbare Anweisung, die Verarbeitungseinheit ist mit der Speichereinheit verbunden, und die Verarbeitungseinheit führt die in der Speichereinheit gespeicherte computerausführbare Anweisung aus, um es der Basisstation zu ermöglichen, das Verbindungswiederaufnahmeanforderungsverfahren gemäß einer beliebigen Implementierung des zweiten Aspekts durchzuführen.

source: [0045] In another possible design, when the apparatus is the chip in the target base station, the chip includes a receiving unit and a sending unit, and optionally further includes a processing unit.
de_de: [0045] In einer anderen möglichen Ausgestaltung umfasst, wenn die Vorrichtung der Chip in der Zielbasisstation ist, der Chip eine Empfangseinheit und eine Sendeeinheit und umfasst optional ferner eine Verarbeitungseinheit.

source: The processing unit may execute the computer executable instruction stored in the storage unit, so that the connection resume request method according to any implementation of the second aspect is performed.
de_de: Die Verarbeitungseinheit kann die in der Speichereinheit gespeicherte computerausführbare Anweisung ausführen, so dass das Verbindungswiederaufnahmeanforderungsverfahren gemäß einer beliebigen Implementierung des zweiten Aspekts durchgeführt wird.

source: Alternatively, the storage unit may be a storage unit that is in the terminal and that is located outside the chip, such as a ROM, another type of static storage device that can store static information and an instruction, or a RAM.
de_de: Alternativ kann die Speichereinheit eine Speichereinheit sein, die sich in dem Endgerät befindet und die sich außerhalb des Chips befindet, wie etwa ein ROM, eine andere Art von statischer Speichervorrichtung, die statische Informationen und eine Anweisung speichern kann, oder ein RAM.

source: [0046] The processor mentioned anywhere above may be a general-purpose CPU, a microprocessor, an ASIC, or one or more integrated circuits configured to control program execution of the connection resume request method according to any implementation of the second aspect.
de_de: [0046] Der Prozessor, der an einer beliebigen Stelle vorstehend erwähnt ist, kann eine Mehrzweck-CPU, ein Mikroprozessor, eine ASIC oder eine oder mehrere integrierte Schaltungen sein, die konfiguriert sind, um die Programmausführung des Verbindungswiederaufnahmeanforderungsverfahrens gemäß einer beliebigen Implementierung des zweiten Aspekts zu steuern.

source: [0047] According to an eighth aspect, this application provides an apparatus.
de_de: [0047] Gemäß einem achten Aspekt stellt diese Anmeldung eine Vorrichtung bereit.

source: The apparatus has a function of implementing each embodiment of the third aspect.
de_de: Die Vorrichtung weist eine Funktion zum Implementieren jeder Ausführungsform des dritten Aspekts auf.

source: [0048] In a possible design, when the apparatus is the target base station, the base station includes a receiving unit and a sending unit, and optionally further includes a processing unit.
de_de: [0048] In einer möglichen Ausgestaltung beinhaltet die Basisstation, wenn die Vorrichtung die Zielbasisstation ist, eine Empfangseinheit und eine Sendeeinheit und optional ferner eine Verarbeitungseinheit.

source: When the base station includes the storage unit, the storage unit stores a computer executable instruction, the processing unit is connected to the storage unit, and the processing unit executes the computer executable instruction stored in the storage unit, to enable the base station to perform the connection resume request method according to any implementation of the third aspect.
de_de: Wenn die Basisstation die Speichereinheit umfasst, speichert die Speichereinheit eine computerausführbare Anweisung, die Verarbeitungseinheit ist mit der Speichereinheit verbunden, und die Verarbeitungseinheit führt die in der Speichereinheit gespeicherte computerausführbare Anweisung aus, um es der Basisstation zu ermöglichen, das Verbindungswiederaufnahmeanforderungsverfahren gemäß einer beliebigen Implementierung des dritten Aspekts durchzuführen.

source: [0049] In another possible design, when the apparatus is the chip in the target base station, the chip includes a receiving unit and a sending unit, and optionally further includes a processing unit.
de_de: [0049] In einer anderen möglichen Ausgestaltung umfasst, wenn die Vorrichtung der Chip in der Zielbasisstation ist, der Chip eine Empfangseinheit und eine Sendeeinheit und umfasst optional ferner eine Verarbeitungseinheit.

source: The processing unit may execute the computer executable instruction stored in the storage unit, so that the connection resume request method according to any implementation of the third aspect is performed.
de_de: Die Verarbeitungseinheit kann die in der Speichereinheit gespeicherte computerausführbare Anweisung ausführen, so dass das Verbindungswiederaufnahmeanforderungsverfahren gemäß einer beliebigen Implementierung des dritten Aspekts durchgeführt wird.

source: [0050] The processor mentioned anywhere above may be a general-purpose CPU, a microprocessor, an ASIC, or one or more integrated circuits configured to control program execution of the connection resume request method according to any implementation of the third aspect.
de_de: [0050] Der Prozessor, der an einer beliebigen Stelle oben erwähnt ist, kann eine Mehrzweck-CPU, ein Mikroprozessor, eine ASIC oder eine oder mehrere integrierte Schaltungen sein, die konfiguriert sind, um die Programmausführung des Verbindungswiederaufnahmeanforderungsverfahrens gemäß einer beliebigen Implementierung des dritten Aspekts zu steuern.

source: [0051] According to a ninth aspect, this application provides an apparatus.
de_de: [0051] Gemäß einem neunten Aspekt stellt diese Anmeldung eine Vorrichtung bereit.

source: The apparatus may be a source base station, or may be a chip in a source base station.
de_de: Die Vorrichtung kann eine Quellbasisstation sein oder kann ein Chip in einer Quellbasisstation sein.

source: The apparatus has a function of implementing each embodiment of the fourth aspect.
de_de: Die Vorrichtung weist eine Funktion zum Implementieren jeder Ausführungsform des vierten Aspekts auf.

source: [0052] In a possible design, when the apparatus is the source base station, the base station includes a receiving unit and a sending unit, and optionally further includes a processing unit.
de_de: [0052] In einer möglichen Ausgestaltung beinhaltet die Basisstation, wenn die Vorrichtung die Quellbasisstation ist, eine Empfangseinheit und eine Sendeeinheit und optional ferner eine Verarbeitungseinheit.
